tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-versions"

# User Tools
cask "1password"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "maestral"
cask "microsoft-office"
cask "omnigraffle"
cask "protonvpn"
cask "rectangle"
cask "signal"
cask "tunnelbear"

# Software Development
brew "awscli"
brew "gh"
brew "git"
brew "go"
brew "httpie"
brew "hugo"
brew "node"
brew "poetry"
cask "docker"
cask "github"
cask "postman"
cask "sf-symbols"
cask "sourcetree"
cask "visual-studio-code"

# Java Development
cask "temurin11"
cask "temurin17"
cask "temurin"
brew "maven", args: ["ignore-dependencies"]
cask "scenebuilder"
